Documents/упРегламентнаяОперация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>упРегламентнаяОперация</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.упВыработкаТС</xr:Item>
				<xr:Item>AccumulationRegister.упПрочиеРасходы</xr:Item>
				<xr:Item>AccumulationRegister.упДоходыРасходыПредприятия</xr:Item>
				<xr:Item>AccumulationRegister.упОстаткиГСМ</xr:Item>
				<xr:Item>AccumulationRegister.упРасходыНаТС</xr:Item>
				<xr:Item>AccumulationRegister.упРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыРегламентныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упСтатусыОперацииЗакрытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ошибки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/упСтатусыОперацииЗакрытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упСтатусыОперацииЗакрытия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЕстьОшибки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исключена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упВидыРегламентныхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упВидыРегламентныхОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АмортизацияТранспортныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаСтоимостиГСМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеКосвенныхРасходов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/упРегламентнаяОперация/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Дата        = упСервисныеФункцииВызовСервера.ДатаСеансаНачалоДняКонецМесяца();
	Автор       = ПользователиКлиентСервер.ТекущийПользователь();
	Статус      = Перечисления.упСтатусыОперацииЗакрытия.НеВыполнена;
	ВидОперации = Перечисления.упВидыРегламентныхОпераций.АмортизацияТранспортныхСредств;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Истина
		И ПометкаУдаления
		И Статус <> Перечисления.упСтатусыОперацииЗакрытия.НеВыполнена
	Тогда
		ОтменитьПроведениеОперацииЗакрытия(Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограмныйИнтерфейс

// Процедура завершения документа. Формирование движений по регистрам. Изменение статуса.
//
Процедура ПровестиОперациюЗакрытия(сткПрогресс, Отказ = Ложь) Экспорт

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если упЗакрытиеПериода.ЕстьДокументыЗакрытия(Ссылка, ВидОперации, Дата) Тогда
		Отказ = Истина;	
		Возврат;
	КонецЕсли; 
		
	Если Ложь
		Или ЭтоНовый() 
		Или Модифицированность() 
	Тогда
		Записать();
	КонецЕсли;
	
	РеквизитыОбъекта = Новый Структура();
	РеквизитыОбъекта.Вставить("Дата",        Дата);
	РеквизитыОбъекта.Вставить("ВидОперации", ВидОперации);
	РеквизитыОбъекта.Вставить("Объект",      ЭтотОбъект);
	
	мсвПриемникиИнформацииОбОшибках = Новый Массив;
	ПодготовитьСтруктурыДанныхДляДобавленияИнформацииОбОшибках(мсвПриемникиИнформацииОбОшибках);
	
	ДополнительныеСвойства.Вставить("Прогресс", сткПрогресс);
	
	упЗакрытиеПериода.СформироватьДвижения(ДополнительныеСвойства, Ссылка, Движения, РеквизитыОбъекта, Отказ);
	
	ДополнитьИнформациюОбОшибкахСообщениямиПользователю(мсвПриемникиИнформацииОбОшибках);
			
	Если Отказ Тогда
		упСервисныеФункции.УдалитьДвижения(Движения);
		НовыйСтатус = Перечисления.упСтатусыОперацииЗакрытия.ЕстьОшибки;
	Иначе
		НовыйСтатус = Перечисления.упСтатусыОперацииЗакрытия.Выполнена;
	КонецЕсли;
	
	ИзменитьСтатусОперацииЗакрытия(НовыйСтатус);
	
КонецПроцедуры

// Процедура ответны завершения документа. Удаление движений. Отмена статуса.
//
Процедура ОтменитьПроведениеОперацииЗакрытия(Отказ = Ложь) Экспорт
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	УстановитьПривилегированныйРежим(Истина);                
		
	упСервисныеФункции.УдалитьДвижения(Движения);
	
	упЗакрытиеПериода.ОтменитьПроведениеСвязанныхДокументов(Ссылка, Отказ);

	Ошибки = Неопределено;
	
	ИзменитьСтатусОперацииЗакрытия(Перечисления.упСтатусыОперацииЗакрытия.НеВыполнена);
	
КонецПроцедуры // ОтменитьОперацию()

// Пропустить операцию закрытия.
//
Процедура ИсключитьОперациюЗакрытия(Отказ = Ложь) Экспорт

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);

	Если упЗакрытиеПериода.ЕстьДокументыЗакрытия(Ссылка, ВидОперации, Дата) Тогда
		Отказ = Истина;	
		Возврат;
	КонецЕсли; 
		
	Если Статус = Перечисления.упСтатусыОперацииЗакрытия.Выполнена Тогда
		упСервисныеФункции.УдалитьДвижения(Движения);
	КонецЕсли;
	
	Ошибки = Неопределено;
	Статус = Перечисления.упСтатусыОперацииЗакрытия.Исключена;
	Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // ПропуститьОперацию()

#КонецОбласти

#Область СлужебныеФункции

Процедура ИзменитьСтатусОперацииЗакрытия(НовыйСтатус)
	
	Если НЕ Статус = НовыйСтатус Тогда
		Статус = НовыйСтатус; 
	КонецЕсли;
	
	Если Модифицированность() Тогда
		Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПодготовитьСтруктурыДанныхДляДобавленияИнформацииОбОшибках(мсвПриемникиИнформацииОбОшибках)
	
	ТабличныйДокумент 				= Новый ТабличныйДокумент;
	сткПриемникТабличныйДокумент 	= Новый Структура("Приемник, ЗапрашиваемыйУровеньСообщений",ТабличныйДокумент,2);
	мсвПриемникиИнформацииОбОшибках.Добавить(сткПриемникТабличныйДокумент);
	сткИнформацияОбОшибках = упСервисныеФункцииКлиентСервер.Новый_СтруктураТрассировки(мсвПриемникиИнформацииОбОшибках, "РегламентнаяОперация");
	упСервисныеФункцииКлиентСервер.ДобавитьСообщениеРасшифровки(сткИнформацияОбОшибках,,"ВидОперации",,ВидОперации,2);		
	
	ДополнительныеСвойства.Вставить("сткИнформацияОбОшибках", сткИнформацияОбОшибках);
	
КонецПроцедуры

Процедура ДополнитьИнформациюОбОшибкахСообщениямиПользователю(мсвПриемникиИнформацииОбОшибках)
	
	сткИнформацияОбОшибках = ДополнительныеСвойства.сткИнформацияОбОшибках;
	
	СообщенияПользователю = ПолучитьСообщенияПользователю(Истина);
	
	упСервисныеФункцииКлиентСервер.ДополнитьРасшифровкуСообщениямиПользователю(сткИнформацияОбОшибках, СообщенияПользователю);
	
	упСервисныеФункцииКлиентСервер.СформироватьРасшифровку(сткИнформацияОбОшибках);
		
	ТабличныйДокумент 	= мсвПриемникиИнформацииОбОшибках[0].Приемник;
	Ошибки 				= Новый ХранилищеЗначения(ТабличныйДокумент, Новый СжатиеДанных(9));
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
